Ran Plan for 3 projects:

1. dir: `infrastructure/terraform/staging/browser` workspace: `default`
1. dir: `infrastructure/terraform/staging/dns` workspace: `default`
1. dir: `infrastructure/terraform/staging/project_vars` workspace: `default`

### 1. dir: `infrastructure/terraform/staging/browser` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.browser.aws_acm_certificate.static_cert will be created
+ resource "aws_acm_certificate" "static_cert" {
      + arn                       = (known after apply)
      + certificate_chain         = "384cf698e65fad1ff988a3e42bc10dca40fd28a1"
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.browser.aws_cloudfront_distribution.s3_distribution will be updated in-place
~ resource "aws_cloudfront_distribution" "s3_distribution" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
      ~ aliases                        = [
          + "static.dev.snuderls.eu",
        ]
        arn                            = "arn:aws:cloudfront::712861137634:distribution/ES8O6LHWVGITC"
        caller_reference               = "terraform-20200402124438611200000002"
        comment                        = "insight-staging-static (Managed by Terraform)"
        domain_name                    = "d1l87tz7sw1x04.cloudfront.net"
        enabled                        = true
        etag                           = "EKCOZBR0IALD2"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "ES8O6LHWVGITC"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-06-16 19:04:42.231 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {
            "environment" = "staging"
        }
        wait_for_deployment            = false

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
                "OPTIONS",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
                "OPTIONS",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "insight-staging-static-origin"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = [
                    "Access-Control-Request-Headers",
                    "Access-Control-Request-Method",
                    "Origin",
                ]
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

        origin {
            domain_name = "insight-staging-static.s3.amazonaws.com"
            origin_id   = "insight-staging-static-origin"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/E32GIERXQY13OT"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

      ~ viewer_certificate {
          - cloudfront_default_certificate = true -> null
          + iam_certificate_id             = (known after apply)
            minimum_protocol_version       = "TLSv1"
        }
    }

  # module.browser.cloudflare_record.static will be created
+ resource "cloudflare_record" "static" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "static.dev.snuderls.eu"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 1
      + type        = "CNAME"
      + value       = "d1l87tz7sw1x04.cloudfront.net"
      + zone_id     = "213.161.29.246"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/browser`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fbrowser%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/browser`
</details>

---
### 2. dir: `infrastructure/terraform/staging/dns` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/dns`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fdns%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/dns`

---
### 3. dir: `infrastructure/terraform/staging/project_vars` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/staging/project_vars`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fstaging%252Fproject_vars%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/staging/project_vars`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
